mm32/mm32_classb_cm0/iec60730b_f0020/Device/MM32F0020/HAL_Lib/Src/hal_rcc.c
/*
(state) ? (RCC->AHBENR |= ahb_periph) : (RCC->AHBENR &= ~ahb_periph);
(state) ? (RCC->APB1ENR |= apb1_periph) : (RCC->APB1ENR &= ~apb1_periph);
(state) ? (RCC->APB2ENR |= apb2_periph) : (RCC->APB2ENR &= ~apb2_periph);
*/

////////////////////////////////////////////////////////////////////////////////
/// @brief  Enables or disables the specified ADC peripheral Clock.
/// @param  peripheral:select the ADC peripheral.
/// @param  state: new state of the ADC peripheral.
/// @retval None.
////////////////////////////////////////////////////////////////////////////////
void RCC_ADC_ClockCmd(ADC_TypeDef* peripheral, FunctionalState state)
{
    switch (*(vu32*)&peripheral) {

        case ADC1_BASE:
            (state) ? (RCC->APB1ENR |= RCC_APB1ENR_ADC1) : (RCC->APB1ENR &= ~RCC_APB1ENR_ADC1);
            break;
        default:
            break;
    }

}



////////////////////////////////////////////////////////////////////////////////
/// @brief  Enables or disables the specified CRC peripheral Clock.
/// @param  peripheral:select the CRC peripheral.
/// @param  state: new state of the CRC peripheral.
/// @retval None.
////////////////////////////////////////////////////////////////////////////////
void RCC_CRC_ClockCmd(CRC_TypeDef* peripheral, FunctionalState state)
{
    if(CRC == peripheral) {
        (state) ? (RCC->AHBENR |= RCC_AHBENR_CRC) : (RCC->AHBENR &= ~RCC_AHBENR_CRC);
    }
}



////////////////////////////////////////////////////////////////////////////////
/// @brief  Enables or disables the specified GPIO peripheral Clock.
/// @param  peripheral:select the GPIO peripheral.
/// @param  state: new state of the GPIO peripheral.
/// @retval None.
////////////////////////////////////////////////////////////////////////////////
void RCC_GPIO_ClockCmd(GPIO_TypeDef* peripheral, FunctionalState state)
{
    switch (*(vu32*)&peripheral) {
        case (u32)GPIOA:
            (state) ? (RCC->AHBENR |= RCC_AHBENR_GPIOA) : (RCC->AHBENR &= ~RCC_AHBENR_GPIOA);
            break;
        case (u32)GPIOB:
            (state) ? (RCC->AHBENR |= RCC_AHBENR_GPIOB) : (RCC->AHBENR &= ~RCC_AHBENR_GPIOB);
            break;
        default:
            break;
    }
}


////////////////////////////////////////////////////////////////////////////////
/// @brief  Deinitializes the uart peripheral registers to their
///         default reset values.
/// @param  peripheral: Select the UART or the UART peripheral.
/// @retval None.
////////////////////////////////////////////////////////////////////////////////
void RCC_UART_ClockCmd(UART_TypeDef* peripheral, FunctionalState state)
{
    if(UART2 == peripheral) {
        (state) ? (RCC->APB1ENR |= RCC_APB1ENR_UART2) : (RCC->APB1ENR &= ~RCC_APB1ENR_UART2);//exRCC_APB1PeriphReset(RCC_APB1ENR_UART2);
    }
    if(UART1 == peripheral) {
        (state) ? (RCC->APB1ENR |= RCC_APB1ENR_UART1) : (RCC->APB1ENR &= ~RCC_APB1ENR_UART1);
    }
}
/// @}

/// @}

/// @}
